<a href="https://colab.research.google.com/github/clerisson-san/Analise_de_dados_com_Python_e_Pandas_by_DIO/blob/main/Pandas_Aula4_e_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Trabalhando com Planilhas do Excel**

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
#Importando a biblioteca
import pandas as pd

In [4]:
#Leitura dos arquivos
df1 = pd.read_excel("/content/drive/MyDrive/Estrutura_de_dados/Aracaju.xlsx")
df2 = pd.read_excel("/content/drive/MyDrive/Estrutura_de_dados/Fortaleza.xlsx")
df3 = pd.read_excel("/content/drive/MyDrive/Estrutura_de_dados/Natal.xlsx")
df4 = pd.read_excel("/content/drive/MyDrive/Estrutura_de_dados/Recife.xlsx")
df5 = pd.read_excel("/content/drive/MyDrive/Estrutura_de_dados/Salvador.xlsx")

In [5]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [6]:
df2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [7]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [8]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [9]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [10]:
df.sample(10)

        Cidade       Data  Vendas  LojaID  Qtde
187   Salvador 2019-01-02    3.85    1035     3
53    Salvador 2019-01-01   39.50    1035     3
50       Natal 2019-03-08  324.00     854     4
158      Natal 2019-01-02  183.64    1037     3
67   Fortaleza 2019-01-01   43.51    1003     1
9        Natal 2018-05-02  261.00     852     3
110      Natal 2019-01-02  185.93    1036     3
117     Recife 2019-03-02   15.42     983     8
21   Fortaleza 2019-01-01   40.63    1004     3
145   Salvador 2019-01-02   84.62    1034     2

In [11]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [ ]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [12]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

**Tratando valores faltantes**

In [13]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [14]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [15]:
df["Vendas"].mean()

122.61180089485438

In [16]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [17]:
df.sample(15)

        Cidade       Data  Vendas  LojaID  Qtde
219      Natal 2019-01-02   19.67    1037     2
84    Salvador 2019-01-01   22.99    1036     1
96   Fortaleza 2019-01-01   23.31    1004     4
111     Recife 2019-03-02    8.00     981     3
142   Salvador 2019-01-02    7.12    1034     1
82     Aracaju 2018-01-01  150.48    1522     4
132     Recife 2019-03-02   17.49     983     5
125    Aracaju 2018-01-01   15.62    1522     2
239   Salvador 2019-01-03  161.41    1037     3
59     Aracaju 2018-01-01   15.07    1523     7
44   Fortaleza 2019-01-01  215.11    1003     1
128   Salvador 2019-03-02   36.84    1034     1
105     Recife 2019-01-01   41.12     980     3
104  Fortaleza 2019-01-01   40.50    1005     2
216   Salvador 2019-01-02    5.82    1035     1

In [18]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [19]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [ ]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [ ]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [20]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [21]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00    1520     1   142.00
1  Aracaju 2018-01-01   14.21    1522     6    85.26
2  Aracaju 2018-01-01   71.55    1520     1    71.55
3  Aracaju 2018-01-01    3.01    1521     7    21.07
4  Aracaju 2018-01-01   24.51    1522     8   196.08

In [ ]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [ ]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00    1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21    1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55    1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01    1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51    1522     8   196.08             8.0

In [ ]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [ ]:
#Retornando a menor receita
df["Receita"].min()

0.0

In [23]:
#nlargest
df.nlargest(5, "Receita")

   Cidade       Data  Vendas  LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0     853     4   3544.0
51  Natal 2018-01-21   859.0     852     4   3436.0
55  Natal 2019-01-08   859.0     854     4   3436.0
30  Natal 2018-10-02   856.0     853     4   3424.0
41  Natal 2018-05-20   835.0     852     4   3340.0

In [24]:
#nsamllest
df.nsmallest(5, "Receita")

       Cidade       Data  Vendas  LojaID  Qtde  Receita
118   Aracaju 2018-01-01    3.34    1522     1     3.34
65     Recife 2019-01-01    4.01     981     1     4.01
92      Natal 2019-01-02    4.57    1035     1     4.57
92   Salvador 2019-01-01    4.57    1035     1     4.57
95      Natal 2019-01-02    5.13    1035     1     5.13

In [ ]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     36122.23
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [25]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas  LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0     853     4   3544.0
55  Natal 2019-01-08   859.0     854     4   3436.0
51  Natal 2018-01-21   859.0     852     4   3436.0
30  Natal 2018-10-02   856.0     853     4   3424.0
41  Natal 2018-05-20   835.0     852     4   3340.0
38  Natal 2018-02-25   828.0     852     4   3312.0
10  Natal 2018-10-27   828.0     852     4   3312.0
69  Natal 2019-03-24   817.0     852     4   3268.0
62  Natal 2018-02-10   793.0     854     4   3172.0
52  Natal 2018-04-27   778.0     854     4   3112.0

#**Trabalhando com datas**

In [26]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [27]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade      object
Data         int64
Vendas     float64
LojaID       int64
Qtde         int64
Receita    float64
dtype: object

In [28]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [29]:
df.dtypes

Cidade             object
Data       datetime64[ns]
Vendas            float64
LojaID              int64
Qtde                int64
Receita           float64
dtype: object

In [30]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [ ]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [ ]:
df.sample(5)

       Cidade       Data  Vendas  ... Receita  Receita/Vendas  Ano_Venda
124  Salvador 2019-03-02   44.82  ...  134.46             3.0       2019
218  Salvador 2019-01-02  189.12  ...  567.36             3.0       2019
82    Aracaju 2018-01-01  150.48  ...  601.92             4.0       2018
29   Salvador 2019-01-01    9.27  ...    9.27             1.0       2019
123  Salvador 2019-03-02  127.45  ...  382.35             3.0       2019

[5 rows x 8 columns]

In [ ]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [ ]:
df.sample(5)

      Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
97  Salvador 2019-01-01   39.91  ...      2019          1          1
12   Aracaju 2019-01-01    9.78  ...      2019          1          1
59     Natal 2018-01-15  369.00  ...      2018          1         15
13     Natal 2018-09-12  458.00  ...      2018          9         12
16   Aracaju 2018-01-01   37.68  ...      2018          1          1

[5 rows x 10 columns]

In [ ]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [31]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [32]:
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde  Receita diferenca_dias
68   Salvador 2019-01-01  162.35    1037     3   487.05       365 days
223  Salvador 2019-01-02   40.51    1037     2    81.02       366 days
114   Aracaju 2018-01-01   10.17    1520     5    50.85         0 days
113    Recife 2019-03-02   38.63     980     2    77.26       425 days
155     Natal 2019-01-02  237.81    1036     3   713.43       366 days

In [33]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [35]:
df.sample(5)

       Cidade       Data  Vendas  ...  Receita  diferenca_dias  trimestre_venda
221  Salvador 2019-01-02  142.23  ...   284.46        366 days                1
2      Recife 2019-02-10   12.94  ...    64.70        405 days                1
20      Natal 2018-06-08  608.00  ...  2432.00        158 days                2
50      Natal 2019-03-08  324.00  ...  1296.00        431 days                1
225     Natal 2019-01-02   36.23  ...    36.23        366 days                1

[5 rows x 8 columns]

In [38]:
#Filtrando as vendas de 2019 do mês de março
df_vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [39]:
df_vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ...  Receita  diferenca_dias  trimestre_venda
136     Recife 2019-03-02   39.09  ...   156.36        425 days                1
122     Recife 2019-03-02  235.06  ...   705.18        425 days                1
69       Natal 2019-03-24  817.00  ...  3268.00        447 days                1
126     Recife 2019-03-02   41.87  ...   334.96        425 days                1
127  Fortaleza 2019-03-02   39.56  ...   316.48        425 days                1
109   Salvador 2019-03-02  124.37  ...   124.37        425 days                1
130     Recife 2019-03-02   12.36  ...    49.44        425 days                1
132   Salvador 2019-03-02   19.61  ...    39.22        425 days                1
136   Salvador 2019-03-02   13.81  ...    13.81        425 days                1
139  Fortaleza 2019-03-02  141.16  ...   988.12        425 days                1
45       Natal 2019-03-11  431.00  ...  1293.00        434 days                1
133   Salvador 2019-03-02  153.71  ...   153.71        425 days                1
127   Salvador 2019-03-02  240.61  ...   721.83        425 days                1
139   Salvador 2019-03-02  169.01  ...   169.01        425 days                1
135  Fortaleza 2019-03-02   10.79  ...    53.95        425 days                1
131  Fortaleza 2019-03-02  139.07  ...   834.42        425 days                1
124     Recife 2019-03-02   47.98  ...   335.86        425 days                1
138   Salvador 2019-03-02  212.03  ...   636.09        425 days                1
117   Salvador 2019-03-02   39.41  ...    39.41        425 days                1
116  Fortaleza 2019-03-02   79.10  ...   158.20        425 days                1

[20 rows x 8 columns]